In [5]:
import pandas as pd
df_sales = pd.DataFrame(columns=["Date","Amount"])
df_sales

Empty DataFrame
Columns: [Date, Amount]
Index: []

In [6]:
new_data={
    "Date": ["Jan 1","Jan 2"],
    "Amount": [500,600]
}
df_new_data=pd.DataFrame(new_data)
df_new_data

    Date  Amount
0  Jan 1     500
1  Jan 2     600

In [7]:
df_sales = pd.concat([df_sales, df_new_data])
df_sales

    Date Amount
0  Jan 1    500
1  Jan 2    600

In [8]:
df_second= pd.DataFrame({
    "Date": ["jan 3", "jan 4"],
    "Amount": [400,300]
})
df_sales= pd.concat([df_sales,df_second])
df_sales

    Date Amount
0  Jan 1    500
1  Jan 2    600
0  jan 3    400
1  jan 4    300

In [9]:
df_sales.reset_index(drop=True,inplace=True)
df_sales

    Date Amount
0  Jan 1    500
1  Jan 2    600
2  jan 3    400
3  jan 4    300

In [11]:
new_col_data= {
    "Location": ["store A", "Store B"]
}
df_col_data=pd.DataFrame(new_col_data)
df_sales= pd.concat([df_sales,df_col_data],axis=1)
df_sales

    Date Amount Location
0  Jan 1    500  store A
1  Jan 2    600  Store B
2  jan 3    400      NaN
3  jan 4    300      NaN